# Task-02

# Import Labrary

In [48]:
import pandas as pd

# Import Dataset

In [49]:
df=pd.read_csv("C:\\Users\\absub\\Downloads\\tested.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

# Data Manipulation

In [50]:
#Getting first five record
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [51]:
#Getting last five record
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [52]:
#Looking information about Dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [53]:
#Looking information about number of row and column
df.shape

(418, 12)

In [54]:
#Looking information about column of dataset
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# Data Cleanning

# Checking NaN values in respective columns

In [55]:
df['PassengerId'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414    False
415    False
416    False
417    False
Name: PassengerId, Length: 418, dtype: bool

In [56]:
sum(df['PassengerId'].isnull())

0

In [57]:
df['Survived'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414    False
415    False
416    False
417    False
Name: Survived, Length: 418, dtype: bool

In [58]:
sum(df['Survived'].isnull())

0

In [59]:
df['Pclass'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414    False
415    False
416    False
417    False
Name: Pclass, Length: 418, dtype: bool

In [60]:
sum(df['Pclass'].isnull())

0

In [61]:
df['Name'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414    False
415    False
416    False
417    False
Name: Name, Length: 418, dtype: bool

In [62]:
sum(df['Name'].isnull())

0

In [63]:
df['Sex'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
413    False
414    False
415    False
416    False
417    False
Name: Sex, Length: 418, dtype: bool

In [64]:
sum(df['Sex'].isnull())

0

In [65]:
df['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
413     True
414    False
415    False
416     True
417     True
Name: Age, Length: 418, dtype: bool

In [67]:
sum(df['Age'].isnull())

86

In [69]:
df.dropna(subset=['Age'],axis=0,inplace=True)

In [70]:
sum(df['Age'].isnull())

0

In [71]:
df['SibSp'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
409    False
411    False
412    False
414    False
415    False
Name: SibSp, Length: 332, dtype: bool

In [72]:
sum(df['SibSp'].isnull())

0

In [73]:
df['Parch'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
409    False
411    False
412    False
414    False
415    False
Name: Parch, Length: 332, dtype: bool

In [74]:
sum(df['Parch'].isnull())

0

In [75]:
df['Ticket'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
409    False
411    False
412    False
414    False
415    False
Name: Ticket, Length: 332, dtype: bool

In [76]:
sum(df['Ticket'].isnull())

0

In [77]:
df['Fare'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
409    False
411    False
412    False
414    False
415    False
Name: Fare, Length: 332, dtype: bool

In [78]:
sum(df['Fare'].isnull())

1

In [79]:
df.dropna(subset=['Fare'],axis=0,inplace=True)

In [80]:
sum(df['Fare'].isnull())

0

In [81]:
df['Cabin'].isnull()

0       True
1       True
2       True
3       True
4       True
       ...
409     True
411    False
412     True
414    False
415     True
Name: Cabin, Length: 331, dtype: bool

In [82]:
sum(df['Cabin'].isnull())

244

In [83]:
df.dropna(subset=['Cabin'],axis=0,inplace=True)

In [84]:
sum(df['Cabin'].isnull())

0

In [85]:
df['Embarked'].isnull()

12     False
14     False
24     False
26     False
28     False
       ...
404    False
405    False
407    False
411    False
414    False
Name: Embarked, Length: 87, dtype: bool

In [86]:
sum(df['Embarked'].isnull())

0

# Exploratory Data Analysis

In [87]:
df.mean()

C:\Users\absub\AppData\Local\Temp\ipykernel_14444\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

PassengerId    1102.712644
Survived          0.505747
Pclass            1.137931
Age              39.247126
SibSp             0.597701
Parch             0.482759
Fare             98.109198
dtype: float64

In [88]:
df.median()

C:\Users\absub\AppData\Local\Temp\ipykernel_14444\530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

PassengerId    1094.0000
Survived          1.0000
Pclass            1.0000
Age              39.0000
SibSp             1.0000
Parch             0.0000
Fare             71.2833
dtype: float64

In [89]:
df.std()

C:\Users\absub\AppData\Local\Temp\ipykernel_14444\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

PassengerId    126.751901
Survived         0.502865
Pclass           0.435954
Age             15.218730
SibSp            0.637214
Parch            0.860801
Fare            88.177319
dtype: float64

In [91]:
df.var()

C:\Users\absub\AppData\Local\Temp\ipykernel_14444\1568254755.py:1: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.var()

PassengerId    16066.044373
Survived           0.252874
Pclass             0.190056
Age              231.609730
SibSp              0.406041
Parch              0.740978
Fare            7775.239669
dtype: float64

In [92]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,87.000000,87.000000,87.000000,87.000000,87.000000,87.000000,87.000000
mean,1102.712644,0.505747,1.137931,39.247126,0.597701,0.482759,98.109198
std,126.751901,0.502865,0.435954,15.218730,0.637214,0.860801,88.177319
min,904.000000,0.000000,1.000000,1.000000,0.000000,0.000000,0.000000
25%,986.000000,0.000000,1.000000,27.000000,0.000000,0.000000,35.339600
50%,1094.000000,1.000000,1.000000,39.000000,1.000000,0.000000,71.283300
75%,1216.000000,1.000000,1.000000,50.000000,1.000000,1.000000,135.066650
max,1306.000000,1.000000,3.000000,76.000000,3.000000,4.000000,512.329200

# Thank you